TexasInstruments/mspm0-sdk/tools/keil/low_power_mode_patch/TexasInstruments.MSPM0L11XX_L13XX_DFP.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
    <vendor>TexasInstruments</vendor>
    <name>MSPM0L11XX_L13XX_DFP</name>
    <description>Device Family Pack for Texas Instruments MSPM0L11XX_L13XX Series</description>
    <url>http://software-dl.ti.com/msp430/esd/MSPM0-CMSIS/MSPM0L11XX_L13XX/latest/exports/</url>
    <supportContact>https://e2e.ti.com/support/microcontrollers/</supportContact>
    <license>01_Pack\license.txt</license>

    <releases>
        <release version="1.2.1" date="2023-10-12">
        * Fix installation error with previous release
        </release>
        <release version="1.2.0" date="2023-10-04">
        * New Software Pack replacing the deprecated TexasInstruments.MSPM0L_DFP
        </release>
        <release version="1.1.0" date="2023-05-15">
        * Disable cache in flash loader
        * Use address 0x2020_0000 for M0G Flash loader
        * Limit programming range using OPN information
        * Update DriverLib and header files
        </release>
        <release version="1.0.0" date="2023-03-14">
        Initial release of MSPM0L11XX_L13XX series device familiy pack.
        New device support:
            * MSPM0L110X
            * MSPM0L130X
            * MSPM0L134X
        </release>
    </releases>

    <keywords>
        <!-- keywords for indexing -->
        <keyword>Texas Instruments</keyword>
        <keyword>MSPM0</keyword>
        <keyword>MSPM0L</keyword>
        <keyword>MSPM0L1</keyword>
        <keyword>MSPM0L11</keyword>
        <keyword>MSPM0L110</keyword>
        <keyword>MSPM0L1106</keyword>
        <keyword>MSPM0L1105</keyword>
        <keyword>MSPM0L13</keyword>
        <keyword>MSPM0L130</keyword>
        <keyword>MSPM0L1306</keyword>
        <keyword>MSPM0L1305</keyword>
        <keyword>MSPM0L1304</keyword>
        <keyword>MSPM0L1303</keyword>
        <keyword>MSPM0L134</keyword>
        <keyword>MSPM0L1346</keyword>
        <keyword>MSPM0L1345</keyword>
        <keyword>MSPM0L1344</keyword>
        <keyword>MSPM0L1343</keyword>
        <keyword>Device Support</keyword>
        <keyword>Device Family Package Texas Instruments</keyword>
      </keywords>

    <!-- devices section (mandatory for Device Family Packs) -->
    <devices>
        <family Dfamily="MSPM0L11XX_L13XX Series" Dvendor="Texas Instruments:16">
            <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="NO_FPU" Dclock="32000000" Dmpu="NO_MPU" Dendian="Little-endian"/>
            <debugconfig default="swd" clock="5000000" swj="1"/>
            <book name="https://developer.arm.com/documentation/dui0662/latest/" title="Cortex-M0+ Generic User Guide"/>
            <description>
The MSPM0L134X and MSPM0L130X microcontrollers (MCUs) are part of MSP's
highly-integrated, ultra-low-power 32-bit MCU family based on the enhanced
Arm® Cortex®-M0+ core platform operating at up to 32-MHz frequency.

These cost-optimized MCUs offer high-performance analog peripheral integration,
support extended temperature ranges from -40°C to 125°C, and operate with
supply voltages ranging from 1.62V to 3.6V.

The MSPM0L134X and MSPM0L130X devices provide up to 64KB embedded Flash program
memory with up to 4KB SRAM. They incorporate a high speed on-chip oscillator
with an accuracy of ±1%, eliminating the need for an external crystal.
Additional features include a 3-channel DMA, 16 and 32-bit CRC accelerator,
and a variety of high-performance analog peripherals such as one 12-bit 1MSPS
ADC with configurable internal voltage reference, one high-speed comparator
with built-in reference DAC, two zero-drift zero-crossover op-amps with
programmable gain, one general-purpose amplifier, and an on-chip temperature
sensor. These devices also offer intelligent digital peripherals such as
four 16-bit general purpose timers, one windowed watchdog timer, and a
variety of communication peripherals including two UARTs, one SPI, and two I2C.
These communication peripherals offer protocol support for LIN, IrDA, DALI,
Manchester, Smart Card, SMBus, and PMBus.
            </description>
            <debug>
                <!-- Patched ROM Table for a Cortex-M0+ -->
                <datapatch  type="AP" __dp="0" __ap="0" address="0xF8" value="0xF0000003" info="AP BASE Register, ROM Table at 0xF0000002"/>
            </debug>
            <!-- debug sequences -->
            <sequences>
                <sequence name="DebugPortStart">
                    <block>
                        __var nReset = 0x80;
                        __var canReadPins = 0;
                        // De-assert nRESET line to activate the hardware reset
                        canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);
                    </block>

                    <!-- Keep reset active for 50 ms -->
                    <control while="1" timeout="50000"/>

                    <control if="canReadPins">

                        <!-- Assert nRESET line and wait max. 1s for recovery -->
                        <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>

                    </control>

                    <control if="!canReadPins">

                        <block>
                        // Assert nRESET line
                        DAP_SWJ_Pins(nReset, nReset, 0);
                        </block>

                        <!-- Wait 100ms for recovery if nRESET not readable -->
                        <control while="1" timeout="100000"/>

                    </control>

                    <block>
                        __var SW_DP_ABORT       = 0x0;
                        __var DP_CTRL_STAT      = 0x4;
                        __var DP_SELECT         = 0x8;
                        __var powered_down      = 0;

                        //Beyond here do not modify
                        // Switch to DP Register Bank 0
                        //WriteDP(DP_SELECT, 0x00000000);

                        // Read DP CTRL/STAT Register and check if CSYSPWRUPACK and CDBGPWRUPACK bits are set
                        powered_down = ((ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000);
                    </block>
                    <control if="powered_down">
                        <block>
                            // Request Debug/System Power-Up
                            Message(0, "Debug/System power-up request sent");
                            WriteDP(DP_CTRL_STAT, 0x50000000);
                        </block>

                        <!-- Wait for Power-Up Request to be acknowledged -->
                        <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000" timeout="1000000"/>

                        <!-- JTAG Specific Part of sequence -->
                        <control if="(__protocol &amp; 0xFFFF) == 1">

                            <block>
                                // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                                // Additionally clear STICKYORUN, STICKYCMP, and STICKYERR bits by writing '1'
                                WriteDP(DP_CTRL_STAT, 0x50000F32);
                            </block>

                        </control>

                        <!-- SWD Specific Part of sequence -->
                        <control if="(__protocol &amp; 0xFFFF) == 2">
                            <block>
                                Message(0, "executing SWD power up");
                                // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
                                WriteDP(DP_CTRL_STAT, 0x50000F00);

                                // Clear WDATAERR, STICKYORUN, STICKYCMP, and STICKYERR bits of CTRL/STAT Register by write to ABORT register
                                WriteDP(SW_DP_ABORT, 0x0000001E);
                            </block>
                        </control>
                    </control>
                    <block>
                        __var DPREC0_VAL        = 0;
                        __var DEBUG_PORT_VAL    = 0;
                        __var ACCESS_POINT_VAL  = 0;
                        __ap = 4;

