TexasInstruments/mspm0-sdk/tools/keil/low_power_mode_patch/TexasInstruments.MSPM0L11XX_L13XX_DFP.pdsc
                        ACCESS_POINT_VAL = ReadAP(0x00);//Reading current state of DPREC0
                        Message(0, "Current state of DPREC0 is: %x",ACCESS_POINT_VAL);
                    </block>
                    <control if = "(ACCESS_POINT_VAL &amp; 0x00E00000) == 0">
                        <block>
                            WriteAP(0x00, 0x190008);
                            __ap = 0; //reset AP selection
                        </block>
                    </control>
                    <control if = "(ACCESS_POINT_VAL &amp; 0x00E00000) != 0">
                        <block>
                            Message(0, "STICKY BITS ENABLED");

                            WriteAP(0xF0, 0x00000001);

                            WriteAP(0x00, 0xF90008);

                            ACCESS_POINT_VAL = ReadAP(0x00);
                            Message(0, "Current state of DPREC0 is: %x",ACCESS_POINT_VAL);
                            __ap = 0; //reset AP selection
                        </block>
                    </control>
                </sequence>
                <sequence name="DebugDeviceUnlock">
                    <block>
                        __var deviceID = 0;
                        __var version = 0;
                        __var partNum = 0;
                        __var manuf = 0;
                        __var isMSPM0L11XX_L13XX = 0;
                        __var isProduction = 0;
                        __var continueId = 0;
                        deviceID =   Read32(0x41C40004);
                        version = deviceID >> 28;
                        partNum = (deviceID &amp; 0x0FFFF000) >> 12;
                        manuf = (deviceID &amp; 0x00000FFE) >> 1;
                        isMSPM0L11XX_L13XX = (partNum == 0xBB82) &amp;&amp; (manuf == 0x17);
                        isProduction = (version &gt; 0);
                    </block>
                    <!-- Check if device ID is correct -->
                    <control if="!isMSPM0L11XX_L13XX">
                        <block>
                            continueId = Query(1, "Incorrect ID. This support package is for MSPM0L11XX_L13XX devices. Continue?", 4);
                        </block>
                    </control>
                    <control if="continueId == 4">
                        <block>
                            Message(2, "Invalid ID");
                        </block>
                    </control>
                    <!-- Check if the device is early sample material -->
                    <control if="!isProduction">
                        <block>
                            Query(0, "This support package doesn't support MSPM0 early samples. We recommend moving to production-quality MSPM0L11XX_L13XX silicon by ordering samples at www.ti.com/mspm0.", 0);
                            Message(2, "Invalid device revision");
                        </block>
                    </control>
                </sequence>
                <sequence name="DebugCoreStart">
                <block>
                    // System Control Space (SCS) offset as defined in Armv6-M/Armv7-M.
                    Message(0, "Here now");
                    __var SCS_Addr   = 0xE000E000;
                    __var DHCSR_Addr = SCS_Addr + 0xDF0;
                    // Enable Core Debug via DHCSR
                    Write32(DHCSR_Addr, 0xA05F0001);
                </block>

                </sequence>
            </sequences>
            <!-- features common for the whole family -->
            <feature type="NVIC" n="32" name="Nested Vectored Interrupt Controller (NVIC)"/>
            <feature type="DMA" n="3" name="Direct Memory Access (DMA)"/>
            <feature type="MemoryOther" name="Up to 64KB Flash memory"/>
            <feature type="MemoryOther" name="Up to 4KB SRAM"/>
            <feature type="ClockOther" name="Internal 4-32MHz oscillator with +-1% accuracy (SYSOSC)"/>
            <feature type="ClockOther" name="Internal 32kHz oscillator (LFOSC)"/>
            <feature type="PowerMode" n="12" name="RUN0, RUN1, RUN2, SLEEP0, SLEEP1, SLEEP2, STOP0, STOP1, STOP2, STANDBY0, STANDBY1, SHUTDOWN"/>
            <feature type="VCC" n="1.62" m="3.6"/>
            <feature type="Temp" n="-40" m="125" name="Extended Operating Temperature Range"/>
<!-- ************************  Subfamily MSPM0L130X  **************************** -->
            <subFamily DsubFamily="MSPM0L130X">
                <feature type="AnalogOther" n="2" name="Zero-drift, zero-crossover chipper op-amp (OPA)"/>
                <feature type="AnalogOther" n="1" name="General-purpose amplifier (GPAMP)"/>
                <feature type="AnalogOther" n="1" name="High-speed comparator (COMP) with 8-bit reference DACs"/>
                <feature type="AnalogOther" n="1" name="Configurable 1.4V or 2.5V internal shared voltage reference (VREF)"/>
                <feature type="TimerOther" n="4" name="16-bit general purpose timer supporting low power operation in STANDBY mode"/>
                <feature type="WDT" n="1" name="Window-watchdog timer"/>
                <feature type="I2C" n="2" name="I2C interface supporting up to FM+ (1Mbps), SMBus/PMBus, and wakeup from STOP mode"/>
                <feature type="SPI" n="1" m="32000000" name="SPI interface"/>
                <feature type="UART" n="2" name="UART inteface, one supporting LIN, IrDA, DALI, Smart Card, Manchester, and three supporting low-power operation in STANDBY mode"/>
                <feature type="ADC" n="10" m="12" name="1MSPS analog-to-digital converters with up to 10-ch (ADC)"/>
                <feature type="IOs" n="28" name="General purpose I/Os, including some 5-V tolerant"/>
                <!-- *************************  Device MSPM0L1306  ***************************** -->
                <device Dname="MSPM0L1306">
                    <memory     name="IROM1" access="rx"  start="0x00000000" size="0x00010000" startup="1" default="1"/>
                    <memory     name="IRAM1" access="rwx" start="0x20000000" size="0x00001000" default="1"/>
                    <memory     name="NonMain" access="r"  start="0x41C00000" size="0x00000200" default="1"/>
                    <memory     name="Factory" access="r"  start="0x41C40000" size="0x00000080" default="1"/>
                    <compile    define="__MSPM0L1306__"/>
                    <debug      svd="03_SVD/MSPM0L130X.svd"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0L11XX_L13XX_MAIN_64KB.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0L11XX_L13XX_NONMAIN.FLM" start="0x41C00000" size="0x00000200" RAMstart="0x20000000" RAMsize="0x00001000" default="0"/>
                </device>
                <!-- *************************  Device MSPM0L1305  ***************************** -->
                <device Dname="MSPM0L1305">
                    <memory     name="IROM1" access="rx"  start="0x00000000" size="0x00008000" startup="1" default="1"/>
                    <memory     name="IRAM1" access="rwx" start="0x20000000" size="0x00001000" default="1"/>
                    <memory     name="NonMain" access="r"  start="0x41C00000" size="0x00000200" default="1"/>
                    <memory     name="Factory" access="r"  start="0x41C40000" size="0x00000080" default="1"/>
                    <compile    define="__MSPM0L1305__"/>
                    <debug      svd="03_SVD/MSPM0L130X.svd"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0L11XX_L13XX_MAIN_32KB.FLM" start="0x00000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0L11XX_L13XX_NONMAIN.FLM" start="0x41C00000" size="0x00000200" RAMstart="0x20000000" RAMsize="0x00001000" default="0"/>
                </device>
                <!-- *************************  Device MSPM0L1304  ***************************** -->
                <device Dname="MSPM0L1304">
                    <memory     name="IROM1" access="rx"  start="0x00000000" size="0x00004000" startup="1" default="1"/>
                    <memory     name="IRAM1" access="rwx" start="0x20000000" size="0x00000800" default="1"/>
                    <memory     name="NonMain" access="r"  start="0x41C00000" size="0x00000200" default="1"/>
                    <memory     name="Factory" access="r"  start="0x41C40000" size="0x00000080" default="1"/>
                    <compile    define="__MSPM0L1304__"/>
                    <debug      svd="03_SVD/MSPM0L130X.svd"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0L11XX_L13XX_MAIN_16KB.FLM" start="0x00000000" size="0x00004000" RAMstart="0x20000000" RAMsize="0x00000800" default="1"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0L11XX_L13XX_NONMAIN.FLM" start="0x41C00000" size="0x00000200" RAMstart="0x20000000" RAMsize="0x00000800" default="0"/>
                </device>
                <!-- *************************  Device MSPM0L1303  ***************************** -->
                <device Dname="MSPM0L1303">
                    <memory     name="IROM1" access="rx"  start="0x00000000" size="0x00002000" startup="1" default="1"/>
                    <memory     name="IRAM1" access="rwx" start="0x20000000" size="0x00000800" default="1"/>
                    <memory     name="NonMain" access="r"  start="0x41C00000" size="0x00000200" default="1"/>
                    <memory     name="Factory" access="r"  start="0x41C40000" size="0x00000080" default="1"/>
                    <compile    define="__MSPM0L1303__"/>
                    <debug      svd="03_SVD/MSPM0L130X.svd"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0L11XX_L13XX_MAIN_8KB.FLM" start="0x00000000" size="0x00002000" RAMstart="0x20000000" RAMsize="0x00000800" default="1"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0L11XX_L13XX_NONMAIN.FLM" start="0x41C00000" size="0x00000200" RAMstart="0x20000000" RAMsize="0x00000800" default="0"/>
                </device>
            </subFamily>
