TexasInstruments/mspm0-sdk/tools/keil/low_power_mode_patch/TexasInstruments.MSPM0L11XX_L13XX_DFP.pdsc
<!-- ************************  Subfamily MSPM0L134X  **************************** -->
            <subFamily DsubFamily="MSPM0L134X">
                <feature type="AnalogOther" n="2" name="Zero-drift, zero-crossover chipper op-amp (OPA)"/>
                <feature type="AnalogOther" n="1" name="General-purpose amplifier (GPAMP)"/>
                <feature type="AnalogOther" n="1" name="High-speed comparator (COMP) with 8-bit reference DACs"/>
                <feature type="AnalogOther" n="1" name="Configurable 1.4V or 2.5V internal shared voltage reference (VREF)"/>
                <feature type="TimerOther" n="4" name="16-bit general purpose timer supporting low power operation in STANDBY mode"/>
                <feature type="WDT" n="1" name="Window-watchdog timer"/>
                <feature type="I2C" n="2" name="I2C interface supporting up to FM+ (1Mbps), SMBus/PMBus, and wakeup from STOP mode"/>
                <feature type="SPI" n="1" m="32000000" name="SPI interface"/>
                <feature type="UART" n="2" name="UART inteface, one supporting LIN, IrDA, DALI, Smart Card, Manchester, and three supporting low-power operation in STANDBY mode"/>
                <feature type="ADC" n="10" m="12" name="1MSPS analog-to-digital converters with up to 10-ch (ADC)"/>
                <feature type="IOs" n="28" name="General purpose I/Os, including some 5-V tolerant"/>
                <!-- *************************  Device MSPM0L1346  ***************************** -->
                <device Dname="MSPM0L1346">
                    <memory     name="IROM1" access="rx"  start="0x00000000" size="0x00010000" startup="1" default="1"/>
                    <memory     name="IRAM1" access="rwx" start="0x20000000" size="0x00001000" default="1"/>
                    <memory     name="NonMain" access="r"  start="0x41C00000" size="0x00000200" default="1"/>
                    <memory     name="Factory" access="r"  start="0x41C40000" size="0x00000080" default="1"/>
                    <compile    define="__MSPM0L1346__"/>
                    <debug      svd="03_SVD/MSPM0L134X.svd"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0L11XX_L13XX_MAIN_64KB.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0L11XX_L13XX_NONMAIN.FLM" start="0x41C00000" size="0x00000200" RAMstart="0x20000000" RAMsize="0x00001000" default="0"/>
                </device>
                <!-- *************************  Device MSPM0L1345  ***************************** -->
                <device Dname="MSPM0L1345">
                    <memory     name="IROM1" access="rx"  start="0x00000000" size="0x00008000" startup="1" default="1"/>
                    <memory     name="IRAM1" access="rwx" start="0x20000000" size="0x00001000" default="1"/>
                    <memory     name="NonMain" access="r"  start="0x41C00000" size="0x00000200" default="1"/>
                    <memory     name="Factory" access="r"  start="0x41C40000" size="0x00000080" default="1"/>
                    <compile    define="__MSPM0L1345__"/>
                    <debug      svd="03_SVD/MSPM0L134X.svd"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0L11XX_L13XX_MAIN_32KB.FLM" start="0x00000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0L11XX_L13XX_NONMAIN.FLM" start="0x41C00000" size="0x00000200" RAMstart="0x20000000" RAMsize="0x00001000" default="0"/>
                </device>
                <!-- *************************  Device MSPM0L1344  ***************************** -->
                <device Dname="MSPM0L1344">
                    <memory     name="IROM1" access="rx"  start="0x00000000" size="0x00004000" startup="1" default="1"/>
                    <memory     name="IRAM1" access="rwx" start="0x20000000" size="0x00000800" default="1"/>
                    <memory     name="NonMain" access="r"  start="0x41C00000" size="0x00000200" default="1"/>
                    <memory     name="Factory" access="r"  start="0x41C40000" size="0x00000080" default="1"/>
                    <compile    define="__MSPM0L1344__"/>
                    <debug      svd="03_SVD/MSPM0L134X.svd"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0L11XX_L13XX_MAIN_16KB.FLM" start="0x00000000" size="0x00004000" RAMstart="0x20000000" RAMsize="0x00000800" default="1"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0L11XX_L13XX_NONMAIN.FLM" start="0x41C00000" size="0x00000200" RAMstart="0x20000000" RAMsize="0x00000800" default="0"/>
                </device>
                <!-- *************************  Device MSPM0L1343  ***************************** -->
                <device Dname="MSPM0L1343">
                    <memory     name="IROM1" access="rx"  start="0x00000000" size="0x00002000" startup="1" default="1"/>
                    <memory     name="IRAM1" access="rwx" start="0x20000000" size="0x00000800" default="1"/>
                    <memory     name="NonMain" access="r"  start="0x41C00000" size="0x00000200" default="1"/>
                    <memory     name="Factory" access="r"  start="0x41C40000" size="0x00000080" default="1"/>
                    <compile    define="__MSPM0L1343__"/>
                    <debug      svd="03_SVD/MSPM0L134X.svd"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0L11XX_L13XX_MAIN_8KB.FLM" start="0x00000000" size="0x00002000" RAMstart="0x20000000" RAMsize="0x00000800" default="1"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0L11XX_L13XX_NONMAIN.FLM" start="0x41C00000" size="0x00000200" RAMstart="0x20000000" RAMsize="0x00000800" default="0"/>
                </device>
            </subFamily>
<!-- ************************  Subfamily MSPM0L110X  **************************** -->
            <subFamily DsubFamily="MSPM0L110X">
                <feature type="AnalogOther" n="1" name="General-purpose amplifier (GPAMP)"/>
                <feature type="AnalogOther" n="1" name="Configurable 1.4V or 2.5V internal shared voltage reference (VREF)"/>
                <feature type="TimerOther" n="4" name="16-bit general purpose timer supporting low power operation in STANDBY mode"/>
                <feature type="WDT" n="1" name="Window-watchdog timer"/>
                <feature type="I2C" n="1" name="I2C interface supporting up to FM+ (1Mbps), SMBus/PMBus, and wakeup from STOP mode"/>
                <feature type="SPI" n="1" m="32000000" name="SPI interface"/>
                <feature type="UART" n="2" name="UART inteface, one supporting LIN, IrDA, DALI, Smart Card, Manchester, and three supporting low-power operation in STANDBY mode"/>
                <feature type="ADC" n="10" m="12" name="1MSPS analog-to-digital converters with up to 10-ch (ADC)"/>
                <feature type="IOs" n="28" name="General purpose I/Os, including some 5-V tolerant"/>
                <!-- *************************  Device MSPM0L1106  ***************************** -->
                <device Dname="MSPM0L1106">
                    <memory     name="IROM1" access="rx"  start="0x00000000" size="0x00010000" startup="1" default="1"/>
                    <memory     name="IRAM1" access="rwx" start="0x20000000" size="0x00001000" default="1"/>
                    <memory     name="NonMain" access="r"  start="0x41C00000" size="0x00000200" default="1"/>
                    <memory     name="Factory" access="r"  start="0x41C40000" size="0x00000080" default="1"/>
                    <compile    define="__MSPM0L1106__"/>
                    <debug      svd="03_SVD/MSPM0L110X.svd"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0L11XX_L13XX_MAIN_64KB.FLM" start="0x00000000" size="0x00010000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0L11XX_L13XX_NONMAIN.FLM" start="0x41C00000" size="0x00000200" RAMstart="0x20000000" RAMsize="0x00001000" default="0"/>
                </device>
                <!-- *************************  Device MSPM0L1105  ***************************** -->
                <device Dname="MSPM0L1105">
                    <memory     name="IROM1" access="rx"  start="0x00000000" size="0x00008000" startup="1" default="1"/>
                    <memory     name="IRAM1" access="rwx" start="0x20000000" size="0x00001000" default="1"/>
                    <memory     name="NonMain" access="r"  start="0x41C00000" size="0x00000200" default="1"/>
                    <memory     name="Factory" access="r"  start="0x41C40000" size="0x00000080" default="1"/>
                    <compile    define="__MSPM0L1105__"/>
                    <debug      svd="03_SVD/MSPM0L110X.svd"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0L11XX_L13XX_MAIN_32KB.FLM" start="0x00000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
                    <algorithm  name="02_Flash_Programming/FlashARM/MSPM0L11XX_L13XX_NONMAIN.FLM" start="0x41C00000" size="0x00000200" RAMstart="0x20000000" RAMsize="0x00001000" default="0"/>
                </device>
            </subFamily>
        </family>
    </devices>

    <boards>
        <board vendor="TexasInstruments" name="LP-MSPM0L1306" salesContact="http://www.ti.com/general/docs/contact.tsp">
            <description>MSPM0L1306 LaunchPad</description>
            <mountedDevice    deviceIndex="0" Dvendor="Texas Instruments:16" Dname="MSPM0L1306"/>
            <compatibleDevice deviceIndex="0" Dvendor="Texas Instruments:16" Dfamily="MSPM0L11XX_L13XX Series" DsubFamily="MSPM0L130X"/>
            <debugInterface adapter="XDS110-ET" connector="XDS110-ET Onboard Emulator"/>
            <debugInterface adapter="SWD" connector="10-pin Cortex Debug Connector (0.05 inch connector)"/>
            <feature type="USB" n="1" name="USB Device,  Micro-B receptacle"/>
            <feature type="Button" n="3" name="reset and two user push-buttons"/>
            <feature type="LED" n="4" name="LEDs for user interaction, including 1 RGB LED"/>
            <feature type="ConnOther" n="2" name="40 pin BoosterPack Connector and support for 20 pin BoosterPacks"/>
            <feature type="TempSens" n="1" name="Temperature sensor circuit"/>
            <feature type="LightSens" n="1" name="Light sensor circuit"/>
            <feature type="Other" name="EnergyTrace technology available for ultra-low-power debugging"/>
        </board>
    </boards>

</package>
